In [3]:
import pandas as pd

new_df = pd.read_csv('cleaned_titanic.csv')
new_df.head(9)df.groupby('Sex')['Survived'].mean()

   ID  Survived  Class                    Name  Gender        Age     Fare
0   1         0      3        Braund, Mr. Owen    male  22.000000   7.2500
1   2         1      1      Cumings, Mrs. John  female  38.000000  71.2833
2   3         1      3  Heikkinen, Miss. Laina  female  26.000000   7.9250
3   4         1      1  Futrelle, Mrs. Jacques  female  35.000000  53.1000
4   5         0      3      Allen, Mr. William    male  35.000000   8.0500
5   6         0      3        Moran, Mr. James    male  28.111111   8.4583
6   7         0      1   McCarthy, Mr. Timothy    male  54.000000  51.8625
7   8         0      3  Palsson, Master. Gosta    male   2.000000  21.0750
8   9         1      3     Johnson, Mrs. Oscar  female  27.000000  11.1333

In [9]:
new_df.groupby('Gender')['Survived'].mean()

Gender
female    1.0
male      0.0
Name: Survived, dtype: float64

In [13]:
new_df.groupby(['Gender', 'Class'])['Fare'].mean()

Gender  Class
female  1        62.191650
        2        30.070800
        3         9.529150
male    1        51.862500
        3        11.208325
Name: Fare, dtype: float64